{
  "_name_or_path": "dima806/yoga_pose_image_classification",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Bridge",
    "1": "Child",
    "2": "Cobra",
    "3": "Downward-Dog",
    "4": "Pigeon",
    "5": "Standing-Mountain",
    "6": "Tree",
    "7": "Triangle",
    "8": "Warrior"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Bridge": 0,
    "Child": 1,
    "Cobra": 2,
    "Downward-Dog": 3,
    "Pigeon": 4,
    "Standing-Mountain": 5,
    "Tree": 6,
    "Triangle": 7,
    "Warrior": 8
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.37.2"
}
